const mongoose = require('mongoose')
const Schema = mongoose.Schema


/**
 * Οι βεβαιώσεις πεδίων τιμών, που χρησιμοποιούνται από το παρακάτω μοντέλο.
 * Κάθε βεβαίωση συνοδεύεται από την συνθήκη αληθείας και από ένα μήνυμα λάθους
 * σε περίπτωση που δεν πληρεί τις προυποθέσεις.
 * Οι βεβαιώσεις πεδίων τιμών τίθενται σε εφαρμογή ούτως ώστε να μην αποθηκεύονται
 * αντικείμενα με λάθος τιμές στο αποθετήριο/βάση δεδομένων. 
 */
const validations = {
    usageType: {
        condition: (value) => (value === 'εγγραφή' || value === 'παρουσία'),
        message: 'Η συσκευή πρέπει να χρησιμοποιείται είτε για λόγους εγγραφής είτε για λόγους παρουσίας'
    }
}
/**
 * @description Το μοντέλο για τις συσκευές που συνδέονται με το σύστημα και 
 * προσφέρουν υπηρεσίες αναγνώρισης και ταυτοποίησης ενός ατόμου με το 
 * δακτυλικό τους αποτύπωμα.
 * Κάθε τέτοια συσκευή συνδέεται με τις εξής τιμές:
 * deviceID : το μοναδικό αναγνωριστικό της συσκευής
 * usageType : τύπος χρήσης. Μπορεί να φέρει μία εκ των δύο τιμών : "εγγραφή", "παρουσία"
 *              που περιγράφουν με ποιον τρόπο χρησιμοποιείται / ποια υπηρεσία προσφέρει 
 *              (είτε αυτή της εγγραφής, είτε αυτή της φυσικής παρουσίας)
 * location : Η τρέχουσα τοποθεσία της συσκευής, για λόγους διαχείρησης, σε μορφή περιγραφικής ονομασίας.
 *            Η συγκεκριμένη τιμή δίνεται από την γραμματεία για την σωστή ανάθεση συσκευών στις
 *            ανάλογες αίθουσες/γραφεία/τοποθεσίες.
 */
const fingerprintEndpoint = new Schema({
    deviceID: { required: true, type: String },
    usageType: { required: true, type: String},
    currentSubject: { type: String },
    currentLesson: { type: String },
    location: { type: String }
})

module.exports = mongoose.model('FingerprintEndpoint', fingerprintEndpoint)